LoadTests/tweet_get.yml
config:
  target: http://10.98.178.220:8082
  phases:
    #- duration: 60
     # arrivalRate: 10
      #rampTo: 20
      #name: Warm up phase
    #- duration: 60
     # arrivalRate: 30
      #rampTo: 80
      #name: High load ramp
    - duration: 90
      arrivalRate: 400
      rampTo: 800
      name: Sustained high load
  plugins:
    ensure: {}
    apdex: {}
    http.codes: {}
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
    - get:
       url: "/api/Tweet"